## `terraform/keeping`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Read complete after 0s [id=34d55e91682b29a9c65529178b71ea86f6a6a99b]
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Reading...
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Read complete after 0s [id=42213ff4be793356631c8e7788749fa7d39a9d85]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Reading...
module.custom_iam_role_for_github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:oidc-provider/token.actions.githubusercontent.com]
module.custom_iam.aws_iam_role.task_execution_role: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role]
module.custom_iam_role_for_github.aws_iam_policy.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:policy/minecraft-test-github-actions]
module.custom_iam.aws_iam_policy.chatbot-notification-only: Refreshing state... [id=arn:aws:iam::528163014577:policy/chatbot-notification-only]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Read complete after 0s [id=3154560550]
module.custom_iam.aws_iam_role.main_ecs_tasks: Refreshing state... [id=ecs_tasks-minecraft-test-role]
module.custom_iam.aws_iam_role.chatbot-notification-only: Refreshing state... [id=chatbot-notification-only]
module.custom_vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-069e0d19da08acc11]
module.custom_iam_role_for_github.aws_iam_role.github_actions: Refreshing state... [id=minecraft-test-github-actions]
module.custom_sns.aws_kms_key.for_encrypt_sns_topic: Refreshing state... [id=b0f5a012-53e7-45f6-95ad-ec5012d80e8f]
module.custom_iam_role_for_github.aws_iam_role_policy_attachment.github_actions: Refreshing state... [id=minecraft-test-github-actions-20231102234124186100000001]
module.custom_iam.aws_iam_role_policy_attachment.chatbot-notification-only-attach: Refreshing state... [id=chatbot-notification-only-20231102234124267700000002]
module.custom_iam.aws_iam_role_policy.execution_policy: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role:minecraft-test-task-execution-policy]
module.custom_iam.aws_iam_role_policy.ExecuteCommand: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-ExecuteCommand]
module.custom_iam.aws_iam_role_policy.firelensPolicy: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-firelensPolicy]
module.custom_sns.aws_sns_topic.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_sns.aws_sns_topic_subscription.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic:049cbb40-80e9-4a4d-94f0-079019c65ac9]
module.custom_chatbot.module.chatbot_slack_configuration.aws_cloudformation_stack.chatbot_slack_configuration: Refreshing state... [id=arn:aws:cloudformation:ap-northeast-1:528163014577:stack/chatbot-slack-configuration-minecraft-test-chatbot/59e24810-79d9-11ee-883d-0a9f31ffdf53]
module.custom_vpc.module.fargate_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07092e40a43e02375]
module.custom_vpc.module.allow_nfs_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00229776311a99bf7]
null_resource.name: Refreshing state... [id=8231895595908708610]
module.custom_vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08360778b5d467485]
module.custom_vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-022fffa79faf622c9]
module.custom_vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d7ba7760b7d9729c]
module.custom_vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-033ba38145e7035cd]
module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2004677249]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3000968532]
module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2693259050]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-335530722]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3657641406]
module.custom_vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-033ba38145e7035cd1080289494]
module.custom_vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01941184487436e3e]
module.custom_vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05c1c9d3ad277cd5d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.custom_sns.aws_kms_alias.for_encrypt_sns_topic_alias will be created
  + resource "aws_kms_alias" "for_encrypt_sns_topic_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cwa/for_encrypt_sns_topic"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "b0f5a012-53e7-45f6-95ad-ec5012d80e8f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../modules/github/openid_connect_provider.tf line 6, in data "tls_certificate" "github_actions":
   6:   url = jsondecode(data.http.github_actions_openid_configuration.body).jwks_uri

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>